工业相机Linux SDK使用说明。Build20180531
===========================================================================
版本号： 2.4.0.5

支持相机：GigE相机和U3V相机

支持系统：ubuntu 14.04(32和64位)、ubuntu 16.04(32和64位)、centos7(32和64位)、
		  redhat(64位)
===========================================================================

运行环境配置
===========================================================================
在编译示例程序之前，确认LD_LIBRARY_PATH和MVCAM_COMMON_RUNENV两个环境变量已经生效.
eg: echo $LD_LIBRARY_PATH
    输出：/opt/MVS/lib/xxx:...
	
	echo $MVCAM_COMMON_RUNENV
	输出：/opt/MVS/lib
如果当前环境不存在以上两个环境变量或者变量中不包含/opt/MVS/lib相关值时，需要跳转到安装包所在路径，并输入：
	source ./set_env_path.sh
===========================================================================

程序演示
===========================================================================
Display：图像显示例程。
使用前请先安装X11相关库：sudo apt-get install libx11-dev.
创建的显示窗口不支持拉伸。
1. 使用xlib库来创建图像窗口
2. 枚举设备，选择设备并创建句柄，打开设备
3. 开始取流，调用显示函数传入窗口句柄
4. 输入enter结束取流

===========================================================================
ForceIP：设置forceip
1. 枚举设备，选择设备并创建句柄
2. 设置forceip
3. 输入enter结束取流

===========================================================================
Grab_ImageCallback：回调方式抓取图像
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置触发模式为off
3. 开始取流
4. 若有图像数据，ImageCallBackEx会被调用
5. 输入enter结束取流

===========================================================================
GrabImage：主动方式抓取图像
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置触发模式为off
3. 开始取流，开线程用来获取图像数据
4. 若有图像数据，MV_CC_GetOneFrameTimeout会返回MV_OK
5. 输入enter结束取流

===========================================================================
GrabMultipleCamera：多相机取流
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置触发模式为off
3. 开始取流，开线程用来获取图像数据
4. 若有图像数据，MV_CC_GetOneFrameTimeout会返回MV_OK
5. 输入enter结束取流

===========================================================================
ImageProcess：图像处理(存图和像素格式转换)
1. 枚举设备，选择设备并创建句柄，打开设备
2. 开始取流，若有图像数据，MV_CC_GetOneFrameTimeout会返回MV_OK
3. 选择case 0、1或2来进行不同图像处理方式
4. 输入enter结束取流

===========================================================================
ReconnectDemo：重连示例
1. 开线程，用于重连相机，线程中有枚举、创建句柄、打开相机、注册异常回调功能
2. 若有相机异常断线，则会重新枚举相机并连接第0个相机，
3. 输入enter结束程序

===========================================================================
SetIO：设置IO
1. 枚举设备，选择设备并创建句柄，打开设备
2. 获取LineSelector，设置LineSelector
3. 获取LineMode，设置LineMode
4. 输入enter结束程序

===========================================================================
SetParam：设置参数
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置int型变量，获取int型变量
3. 设置float型变量，获取float型变量
4. 设置enum型变量，获取enum型变量
5. 设置bool型变量，获取bool型变量
6. 设置string型变量，获取string型变量
7. 输入enter结束程序

===========================================================================
Trigger_Image：触发方式取流
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置触发模式为on，设置触发源为软触发
3. 开始取流，开线程用来发送触发命令以及获取图像数据
4. 输入enter结束取流

===========================================================================
Trigger_ImageCallback： 触发回调方式取流
1. 枚举设备，选择设备并创建句柄，打开设备
2. 设置触发模式为on，设置触发源为软触发
3. 开始取流，开线程用来发送触发命令
4. 若有图像数据，ImageCallBackEx会被调用
5. 输入enter结束取流

===========================================================================
ConnectSpecCamera: 无枚举连接相机（相当于MVS中的远程连接相机）
1. 填充相机ip、网卡ip
2. 创建句柄，连接相机
3. 开始取流

===========================================================================
Events: 使用相机事件
1. 枚举设备，选择设备并创建句柄，打开设备
2. 开启Event
3. 注册Event事件回调（可注册单个、多个、全部事件）
4. 开启取流，当事件来临时会在回调中响应

===========================================================================
MultiCast: 组播取流
1. 枚举设备，选择设备并创建句柄，打开设备
2. 选择control或monitor模式
3. 输入组播组ip和端口
4. 开始取流(若是m端需c端开启取流命令)

===========================================================================
ParametrizeCamera_FileAccess: 
1. 枚举设备，选择设备并创建句柄，打开设备
2. 开线程，使用FileAccess读取相机配置文件
3. 开线程，使用FileAccess将配置文件写入相机


===========================================================================
ParametrizeCamera_LoadAndSave:
需要确保代码编辑器输入的路径为UTF-8编码格式
1. 枚举设备，选择设备并创建句柄，打开设备
2. 将相机属性导出到文件中
3. 从文件中导入相机属性
 
